[
{
    "name": "Flora Devlin", 
    "position": "Product Coach and Ex-Product Director at Monzo",
    "description": "“Two talented, down to earth guys who put so much energy and passion into what they do .... they are always looking for ways to connect and support people in their career.”" 
},
{
    "name": "Ronan Tighe", 
    "position": "Chief Product Officer",
    "description": "“Sam has been really helpful to me over the last 5 years as we have scaled our product team at Moonpig from 5 PMs to over 20 today. He is one of the few recruiters that really understands the world of product.”" 
},{
    "name": "Bolaji Abiodun", 
    "position": "Senior Engineer",
    "description": "“Alex has been a breath of fresh air. I’ve had many conversations with recruiters, but talking to Alex felt like talking to a friend with my best interests at heart.”" 
},{
    "name": "Shrutika Sainani", 
    "position": "Product Manager",
    "description": "“Sam introduced me to the bloom mentorship community that he has carefully curated. Through this program, he connected me with my mentor - a PM leader from industry who was in a role I aspired for.”" 
},{
    "name": "Jodie Haywood", 
    "position": "Senior Talent Partner",
    "description": "“It has been great to partner with the team at bloom during my time at Depop. From the get-go, Alex was personable, attentive and maintained a high quality of candidates throughout the pipeline in a tough market.”" 
},{
    "name": "Charlie O'Driscoll", 
    "position": "Head of Tech Recruitment",
    "description": "“Alex knows the Engineering market incredibly well, knows what great looks like and really understood what our hiring bar was and what it meant to work at Deliveroo - not only matching up skills but the right people.”" 
},{
    "name": "Dhinta Foster", 
    "position": "Product Manager",
    "description": "“Sam is simply a notch above any recruiter I've worked with in the product world. His knowledge, advice and willingness to go the extra mile has been refreshing!”" 
},{
    "name": "Sofya Gething", 
    "position": "Senior Product Manager",
    "description": "“The quality of direction that bloom and bloom mentor offer is unlike any other recruitment process. It is evident that Sam and bloom are working with the best talent and the best companies.”" 
},{
    "name": "Neil Byrne", 
    "position": "Engineering Talent Partner",
    "description": "“If you’re looking for a recruitment partner that just ”get it” and a team that make working together fun, then look no further.”" 
},{
    "name": "Julia Godinho", 
    "position": "Product Manager",
    "description": "“Sam has created an incredible community of Product people who are not only passionate about their craft, but also raising the bar in the industry. Sam will go above and beyond to help you!”" 
},{
    "name": "Etienne Martin", 
    "position": "Chief Product Officer",
    "description": "“Sam at bloom has been fantastic at finding the right next move for me, working closely with the board & investors to make sure that each side adjusted properly to create the perfect fit.”" 
},{
    "name": "Amanda Pun", 
    "position": "Founder-in-Residence at Entrepreneur First",
    "description": "“Bloom Mentor offers a curated community of high-calibre individuals you can have inspiring and helpful conversations with. I would highly recommend Bloom Mentor to others in Product!”" 
},{
    "name": "David Conde Marin", 
    "position": "Senior Engineering Manager",
    "description": "“Alex & bloom were instrumental in finding a new role for me that matched exactly what I was looking for in my next challenge.”" 
},{
    "name": "Tara Paranjpe", 
    "position": "Senior Product Manager",
    "description": "“Sam is hands down one of the best recruiting partners I’ve ever worked with. He consistently went above and beyond, & his level of transparency throughout each stage was unparalleled!”" 
},{
    "name": "Rob Crook", 
    "position": "Co-Founder & Chief Product Officer",
    "description": "“bloom don’t just give you what you ask for, they partner with you to figure out exactly what you need and then work tirelessly to help you find it. They’re my first call as both a candidate & hiring manager - 10/10.”" 
},{
    "name": "Thomas Young", 
    "position": "Senior Product Manager",
    "description": "“Sam found me my dream role, Senior Product Manager at Google, I can’t thank him enough for it !”" 
},
{
    "name": "Jacquelyn Guderley", 
    "position": "Product Manager",
    "description": "“Sam put real thought into matching me with mentors he felt I'd connect well with and learn lots from - I was even paired with two mentors, which is amazing !”" 
},
{
    "name": "Jan Klug", 
    "position": "Product Director",
    "description": "“Bloom has paired me with product leaders so vastly experienced that they don't just coach reactively, but can point out what you don't know you don't know. Sam and the team really took care to craft the pairings.”" 
},
{
    "name": "Evelina Wahlström", 
    "position": "Software Engineer",
    "description": "“I'm very grateful for the mentor programme that is bloom mentor...It's been such a nice (and I would say vital) addition to my growth journey, having an external mentor to support me.”" 
},
{
    "name": "Valerio Magliulo", 
    "position": "Co-Founder",
    "description": "“There's no real school to prepare you for a Product Management career. Bloom Mentor is what I wish I had years ago starting out as a PM with little to no guidance available to help me grow.”" 
}
]